load_test1.yml
---
scenarios:
  scen1:
    think-time: 0.5s
    requests:
    - http://localhost:8080/
  scen2:
    think-time: 0.5s
    requests:
    - https://devopsproducttest.service-now.com/

execution:
- scenario: scen1
  hold-for: 20s
- scenario: scen2
  hold-for: 20s

reporting:
- module: passfail
  criteria:
  - avg-rt>5000ms for 5s, stop as failed
- module: junit-xml
  data-source: pass-fail
- module: final_stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: aggregate-results.xml
  dump-csv: aggregate-results.csv